ERP/src/Documents/ПодарочныеПромокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПодарочныеПромокоды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПромокодыПериодДействия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Промокоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Промокод</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПромокодСтрока</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетОт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/Documents/ПодарочныеПромокоды/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ГенерироватьПромокоды(Команда)
	ГенерироватьПромокодыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КопироватьКакСсылки(Команда)
	
	Если ЭтотОбъект.Модифицированность ИЛИ НЕ Объект.Проведен Тогда
		
		ПредупреждениеАсинх("Необходимо провести перед копированием");
		Возврат;
		
	КонецЕсли;
	
	Текст = ПолучитьТекстДляКопированияНаСервере();
	ОбщегоНазначения_Клиент.СкопироватьВБуфер(Текст);
	
КонецПроцедуры

Функция ПолучитьТекстДляКопированияНаСервере()
	
	Текст = "";
	Счетчик = 1;
	
	Для Каждого Стр Из Объект.Промокоды Цикл
		
		Текст = Текст + "#" + Счетчик + Символы.ПС + "t.me/" +
			Константы.ТегТелеграмБота.Получить() + "?start=" +
			Стр.Промокод + Символы.ПС + "____________________" + Символы.ПС;
			
		Счетчик = Счетчик + 1;
			
	КонецЦикла;
		
	Возврат Текст;
	
КонецФункции

Процедура ГенерироватьПромокодыНаСервере()
	
	Для Кол = 1 По КоличествоПромокодов Цикл
		НовыйСтр = Объект.Промокоды.Добавить();
		НовыйСтр.Промокод = ОбщегоНазначения.ГенерироватьСлучайнуюПоследовательностьБуквЦифр(16, Истина);
		НовыйСтр.ДействуетОт = ТекущаяДата();
		НовыйСтр.ДействуетДо = ?(НЕ ОбщегоНазначения.ДатаЗаполнена(ДействуютДо),
			ОбщегоНазначения.ДатаОкончанияВремен(), ДействуютДо
		);
	КонецЦикла;
		
КонецПроцедуры
